logs/sweep/eagle3-8K-swebench-c70.log
CMD vllm bench serve --backend openai --base-url http://127.0.0.1:8000 --model Qwen/Qwen3-14B --endpoint /v1/completions --dataset-name random --num-prompts 560 --max-concurrency 70 --random-input-len 4096 --random-output-len 256 --ignore-eos --save-result --result-filename /root/mktg3389/logs/sweep/eagle3-8K-swebench-c70.bench.json --save-detailed
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f5ed41f5b40>, trust_remote_code=False, seed=0, num_prompts=560, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=70, model='Qwen/Qwen3-14B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/root/mktg3389/logs/sweep/eagle3-8K-swebench-c70.bench.json', ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-35e6d5c9-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-09 19:48:03 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 70
100%|██████████| 560/560 [04:08<00:00,  2.25it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     560       
Failed requests:                         0         
Maximum request concurrency:             70        
Benchmark duration (s):                  248.71    
Total input tokens:                      2293760   
Total generated tokens:                  143360    
Request throughput (req/s):              2.25      
Output token throughput (tok/s):         576.41    
Peak output token throughput (tok/s):    791.00    
Peak concurrent requests:                76.00     
Total token throughput (tok/s):          9798.99   
---------------Time to First Token----------------
Mean TTFT (ms):                          1592.30   
Median TTFT (ms):                        666.81    
P99 TTFT (ms):                           13903.46  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          113.44    
Median TPOT (ms):                        108.02    
P99 TPOT (ms):                           173.07    
---------------Inter-token Latency----------------
Mean ITL (ms):                           154.55    
Median ITL (ms):                         93.79     
P99 ITL (ms):                            466.47    
---------------Speculative Decoding---------------
Acceptance rate (%):                     12.16     
Acceptance length:                       1.36      
Drafts:                                  104816    
Draft tokens:                            314448    
Accepted tokens:                         38241     
Per-position acceptance (%):
  Position 0:                            21.40     
  Position 1:                            10.30     
  Position 2:                            4.79      
==================================================